package main

import "fmt"

/*  const (
	// กำหนดค่า 10 ให้กับตัวแปร number1
	number1 = 10
	// กำหนดค่า 20 ให้กับตัวแปร number2
	number2 = 20
	// กำหนดค่า 30 ให้กับตัวแปร number3
	number3 = 30
)*/

func main() {
	// กำหนดค่า 10 ให้กับตัวแปร number1
	var number1 int = 10
	// กำหนดประเภทข้อมูลอย่างชัดเจน
	printer(number1)

	// กำหนดค่า 20 ให้กับตัวแปร number2
	var number2 = 20
	// กำหนดค่าโดยไม่ประกาศประเภทข้อมูล
	printer(number2)

	// กำหนดค่า 30 ให้กับตัวแปร number3 โดยไม่ประกาศประเภทข้อมูล
	number3 := 30
	// การใช้วิธีการเขียนย่อเพื่อนิยามตัวแปร
	printer(number3)
}

func printer(n int) {
	// พิมพ์ข้อความออกทางหน้าจอ
	// โดยใช้ฟังก์ชัน fmt.Println()
	fmt.Println("the number is:", n)
}

// ในตัวอย่างนี้ ตัวแปร number1, number2, number3 ถูกสร้างขึ้น
// เพื่อแสดงวิธีการประกาศและกำหนดค่าตัวแปรใน Go โดยมีการใช้การ
// ประกาศประเภทข้อมูลอย่างชัดเจน การไม่ประกาศประเภท และการเขียน
// ย่อสำหรับการนิยามตัวแปร
