package main

import "fmt"

// การสร้างตัวแปรหลายตวในครั้งเดียว
// ใน Go สามารถประกาศตัวแปรหลายตัวได้ในครั้งเดียวโดยใช้การแยกด้วย
// เครื่องหมายจุลภภาค ตัวอย่างเช่น
func main() {
	// ในตัวอย่างนี้ ค่า "Palistha" จะถูกกำหนดให้กับตัวแปร name และค่า
	// 22 จะถูกกำหนดให้กับตัวแปร age
	var name, age = "Palistha", 22
	fmt.Println(name, age)

	// โค้ดข้างต้นยังสามารถเขียนได้ในรูปแบบนี้:
	// การใช้รูปแบบนี้ช่วยให้เขียนโค้ดได้กระชับและอ่านง่ายขึ้น
	name1, age1 := "Palistha", 22
	fmt.Println(name1, age1)
}
