package main

import "fmt"

/* ตัวอย่างที่ 2: การเข้าใจประเภท Float */
// โปรแกรมเพื่อแสดง float32 และ float64 ด้วยตัวอย่าง
func main() {
	var salary1 float32
	var salary2 float64

	salary1 = 50000.503882901

	// สามารถเก็บจำนวนทศนิยมด้วยความแม่นยำที่สูงกว่า
	salary2 = 50000.503882901

	fmt.Println(salary1)
	fmt.Println(salary2)
}

/* ในตัวอย่างนี้ ตัวแปร salary1 จะใช้ประเภท float32 ซึ่งอาจสูญเสีย */
/* ความแม่นยำเมื่อเก็บค่าที่มีทศนิยมมาก ในขณะที่ salary2 เป็นประเภท */
/* float64 ซึ่งสามารถเก็บค่าทศนิยมด้วยความแม่นยำที่สูงกว่าได้ */
